results/data/run3/native-static/erik-laptop/quarkus-worker-pool-34000-MEASURE.wrk2.out
Running 1m test @ http://erik-pc.local:8080/greeting/Bob
  4 threads and 100 connections
  Thread calibration: mean lat.: 33.464ms, rate sampling interval: 120ms
  Thread calibration: mean lat.: 33.239ms, rate sampling interval: 120ms
  Thread calibration: mean lat.: 38.545ms, rate sampling interval: 132ms
  Thread calibration: mean lat.: 32.762ms, rate sampling interval: 119ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    36.10ms   24.59ms 276.99ms   71.17%
    Req/Sec     8.53k     1.78k   14.21k    65.97%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   35.36ms
 75.000%   51.58ms
 90.000%   62.05ms
 99.000%  111.81ms
 99.900%  200.06ms
 99.990%  247.42ms
 99.999%  268.54ms
100.000%  277.25ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.202     0.000000            1         1.00
       4.595     0.100000       169442         1.11
      13.567     0.200000       338993         1.25
      21.263     0.300000       508428         1.43
      28.447     0.400000       677795         1.67
      35.359     0.500000       847313         2.00
      38.719     0.550000       932071         2.22
      42.015     0.600000      1016661         2.50
      45.311     0.650000      1102168         2.86
      48.479     0.700000      1186089         3.33
      51.583     0.750000      1270987         4.00
      53.087     0.775000      1313726         4.44
      54.559     0.800000      1355678         5.00
      56.063     0.825000      1397900         5.71
      57.727     0.850000      1440501         6.67
      59.615     0.875000      1482850         8.00
      60.767     0.887500      1504095         8.89
      62.047     0.900000      1525142        10.00
      63.711     0.912500      1546100        11.43
      65.919     0.925000      1567601        13.33
      68.991     0.937500      1588669        16.00
      70.975     0.943750      1599061        17.78
      73.471     0.950000      1609855        20.00
      76.351     0.956250      1620336        22.86
      79.807     0.962500      1630843        26.67
      83.967     0.968750      1641399        32.00
      86.463     0.971875      1646807        35.56
      89.215     0.975000      1652020        40.00
      92.415     0.978125      1657374        45.71
      96.063     0.981250      1662599        53.33
     100.479     0.984375      1667879        64.00
     103.167     0.985938      1670565        71.11
     106.175     0.987500      1673210        80.00
     109.567     0.989062      1675838        91.43
     113.471     0.990625      1678495       106.67
     117.823     0.992188      1681118       128.00
     120.383     0.992969      1682436       142.22
     123.263     0.993750      1683773       160.00
     126.655     0.994531      1685093       182.86
     131.007     0.995313      1686415       213.33
     136.447     0.996094      1687740       256.00
     139.775     0.996484      1688408       284.44
     143.743     0.996875      1689061       320.00
     149.375     0.997266      1689719       365.71
     158.207     0.997656      1690376       426.67
     169.727     0.998047      1691041       512.00
     175.615     0.998242      1691373       568.89
     182.015     0.998437      1691701       640.00
     188.415     0.998633      1692029       731.43
     194.687     0.998828      1692360       853.33
     200.703     0.999023      1692691      1024.00
     204.031     0.999121      1692862      1137.78
     207.359     0.999219      1693023      1280.00
     210.943     0.999316      1693187      1462.86
     215.167     0.999414      1693358      1706.67
     219.519     0.999512      1693519      2048.00
     221.823     0.999561      1693604      2275.56
     224.255     0.999609      1693685      2560.00
     226.943     0.999658      1693766      2925.71
     230.015     0.999707      1693849      3413.33
     233.599     0.999756      1693934      4096.00
     235.519     0.999780      1693972      4551.11
     237.951     0.999805      1694016      5120.00
     239.999     0.999829      1694057      5851.43
     242.431     0.999854      1694098      6826.67
     244.863     0.999878      1694140      8192.00
     246.271     0.999890      1694159      9102.22
     247.551     0.999902      1694179     10240.00
     249.087     0.999915      1694200     11702.86
     250.623     0.999927      1694220     13653.33
     252.799     0.999939      1694242     16384.00
     253.695     0.999945      1694251     18204.44
     255.231     0.999951      1694262     20480.00
     257.023     0.999957      1694272     23405.71
     258.815     0.999963      1694283     27306.67
     261.375     0.999969      1694293     32768.00
     262.143     0.999973      1694298     36408.89
     263.167     0.999976      1694303     40960.00
     264.191     0.999979      1694308     46811.43
     264.959     0.999982      1694314     54613.33
     266.495     0.999985      1694319     65536.00
     267.007     0.999986      1694323     72817.78
     267.263     0.999988      1694324     81920.00
     268.287     0.999989      1694326     93622.86
     268.543     0.999991      1694329    109226.67
     269.823     0.999992      1694333    131072.00
     269.823     0.999993      1694333    145635.56
     270.335     0.999994      1694334    163840.00
     270.591     0.999995      1694335    187245.71
     272.639     0.999995      1694337    218453.33
     273.663     0.999996      1694338    262144.00
     273.919     0.999997      1694339    291271.11
     273.919     0.999997      1694339    327680.00
     274.943     0.999997      1694340    374491.43
     275.455     0.999998      1694341    436906.67
     275.455     0.999998      1694341    524288.00
     275.967     0.999998      1694342    582542.22
     275.967     0.999998      1694342    655360.00
     275.967     0.999999      1694342    748982.86
     276.991     0.999999      1694343    873813.33
     276.991     0.999999      1694343   1048576.00
     276.991     0.999999      1694343   1165084.44
     276.991     0.999999      1694343   1310720.00
     276.991     0.999999      1694343   1497965.71
     277.247     0.999999      1694344   1747626.67
     277.247     1.000000      1694344          inf
#[Mean    =       36.101, StdDeviation   =       24.594]
#[Max     =      276.992, Total count    =      1694344]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2027830 requests in 1.00m, 168.25MB read
Requests/sec:  33797.90
Transfer/sec:      2.80MB